class Subject {
  Subject(this.name, this.words, {this.level});

  String name;
  List<String> words;
  int level = 0;
}

class Const {
  static final List<Subject> gameSubjects = List.of([
    Subject("Нюлэскын улэ",
        "гондыр, коньы, лудкеч, балян, кырпарсь, кион, ӟичы".split(", "), level: 0),
    Subject("Вуын уя", "Эбек, чорыг, бака, кый, ташбака".split(", "), level: 0),
    // Subject(
    //     "Перепеч пушкес",
    //     "Губи, сӥль, курегпуз, сугон, йӧл, кубиста, пешник, барангы"
    //         .split(", "), level: 0),
    Subject(
        "Бакчаын будэ",
        "гордкушман, кешыр, кияр, кубиста, барангы, сугон, кумызь, сяртчы"
            .split(", "), level: 0),
    Subject("Курыт сиён",
        "Кумызь, гордпӧсьтурын, кирень, сугон, аракы".split(", "), level: 0),
    Subject("Удмурт юонъёс",
        "Пӧсятэм, варсь, сюкась, аръян, шукисаль, шуву, аракы".split(", "), level: 2),
    Subject("Удмурт сиён",
        "Пельнянь, перепеч, кокрок, шаньга, кыстыбей, паронка".split(", "), level: 0),
    Subject("Шыдъёс", "Йӧлын, кубистаен, чорыген, борщ".split(", "), level: 0),
    Subject("Мае удмуртъёс чаязы поно",
        "Пыштурын, виртурын, сутэр куар, эмезь куар, тӧдьысяська".split(", "), level: 0),
    Subject(
        "Мугор люкетъёс",
        "Ки, пыд, пыдес, суй, гогы, йыр, пель, чырты, макес, пыдчиньы, чиньы, пельпум, тыбыр, кус"
            .split(", "), level: 0),
    Subject("Ымныр люкетъёс",
        "Ныр, ым, син, синкаш, синлыс, кымыс, ангес, бам, нырпысы".split(", "), level: 0),
    Subject(
        "Адями озьы куара поттыны быгатэ (...ны)",
        "Вераськыны, кесяськыны, черектыны, кырӟаны, гурӟыны, куӵектыны, соргетыны, шыпыртыны"
            .split(", "), level: 1),
    Subject(
        "Арня нуналъёс",
        "Вордӥськон, пуксён, вирнунал, покчиарня, удмуртарня, кӧснунал, арнянунал"
            .split(", "), level: 2),
    Subject("…пум", "Пель, кыл, уж, гыр".split(", "), level: 2),
    Subject("Буёлъёс",
        "Горд, ӵуж, пурысь, сьӧд, курень, лыз, вож, ӵуж, тӧдьы".split(", "), level: 1),
    // Subject("Чорыгъёс", "басы, чипей".split(", ")),
    Subject("Сӥть…", "Сюл, пужы, бӧчы, тэчы".split(", "), level: 1),
    Subject(
        "Табаньлы ыльняне поно", "Пызь, ву, сылал, курегпуз, маял".split(", ")),
    Subject("Вордскем", "Кыл, шаер, нунал".split(", "), level: 2),
    Subject("Писпулэн люкетъёсыз",
        "Куар, вай, модос, выжы, пучы, сяська".split(", "), level: 2),
    Subject(
        "Удмурт воргорон нимъёс",
        "Гири, Гондыр, Дангыр, Микаль, Камай, Донды, Койык, Юбер, Сандыр, Кайсы, Пужей, Пислэг, Лёгор, Петыр, Исьток"
            .split(", "), level: 2),
    Subject(
        "Удмурт нылкышно нимъёс",
        "Италмас, Айно, Зангари, Чачабей, Ӝакы, Дыдык, Ӵана, Узы, Жага, Сяла, Одок, Орина, Матӥ, Натӥ, Сандӥ, Такъян"
            .split(", "), level: 2),
    Subject("…ни", "Дугдылон, сиськон, дышетскон".split(", "), level: 0),
    Subject("Шунды", "Берган, ӝужан, пуксён, йӧлтурын".split(", "), level: 2),
    Subject("Кыл…", "Люкам, тэчет, пыры, дысин, азь".split(", "), level: 1),
    // Subject("Куинь буквалэсь пӧйшуръёс", "Вал, кеч".split(", ")),
    // Subject("Кыр…", "Парсь".split(", ")),
    // Subject("Удмурт йылолъёс",
    //     "Ымусьтон, Вӧй, Быдӟым нунал, Гырон быдтон, Гербер, Виль".split(", "), level: 3),
    Subject(
        "Чеберлыко литература", "Кылбурчи, кылбур, верос, выжыкыл".split(", "), level: 1),
    Subject(
        "Адями сьӧлыкъёс",
        "Алдаськон, лушкаськон, тышкаськон, мактаськон, азьтэмъяськон, вожъяськон"
            .split(", "), level: 2),
    // Subject("Кык валанэн кылъёс",
    //     "Тыл, кыл, сю, ку, ныр, пинь, шуд, Шунды ☺ (азьланьтоно)".split(", "), level: 3),
    // Subject("«ВКонтакте» кыллюкам",
    //     "Эшъёс (ватсано, мон удмуртаз уг пукиськы но уг тодкы)".split(", "), level: 2),
    Subject("Басьтон азьын зынъяськом",
        "Улмо, духи, нянь, майтал, сюсьтыл, сяська".split(", "), level: 2),
    // Subject("Куинь кыллэсь пӧрмем кылъёс",
    //     "Куткулонгуби, (будос нимъёс)".split(", "), level: 3),
    Subject(
        "Шӧдонъёс",
        "Шумпотон, куректон, сюлмаськон, вожпотон, паймон, курадӟон, лӧптон"
            .split(", "), level: 3),
    Subject("Одӥг букваысен кутске но, быре но",
        "Артана, кук, палэп, кокрок".split(", "), level: 1),
    Subject("Вож буёло бакча емышъёс",
        "Сугон, кӧжы, кубиста, кияр, улмо".split(", "), level: 1),
    Subject("Уж дуразы одӥг дӥсен ветло",
        "Эмчи, полицейской, тылкысӥсь, пӧрась".split(", "), level: 1),
    Subject("…чи", "Кылбур, маскар, эм".split(", "), level: 2),
    Subject("20 килолэсь секыт пудо-животъёс но пӧйшуръёс",
        "парсь, скал, вал, така, ош, пыль, дуэ".split(", "), level: 2),
    Subject(
        "Чорыг лым пушкын вань",
        "Чорыг, лым, лы, барангы, сылал, курегпуз, сугон, пӧсьтурын"
            .split(", "), level: 3),
    Subject("...гон", "су, ыр".split(", "), level: 0),
    // Subject("Чиньы нимъёс", "Пӧлы, чӧльы, шорчиньы (азьланьтоно)".split(", "), level: 2),
    Subject("Пыд…", "кутчан, пыдес, тяпа, кук, выл, чиньы".split(", "), level: 2),
    Subject("Йӧллэсь сиён", "Йӧлвыл, йӧлпыд, кузятэм, сыр, аръян".split(", "), level: 3),
    Subject(
        "Крезьгур инструментъёс", "Арган, дымбыр, кубыз, шулан".split(", "), level: 0),
    Subject(
        "Удмурт адями сярысь шуо",
        "Возьдаськись, куатаськись, шыпыт, ужась, кужмо, кырӟась, эктӥсь, визьмо, тыршись, йӧно, горд"
            .split(", "), level: 1),
    Subject("Нюлэскын бичаськом",
        "Губи, эмезь, палэзь, льӧм, узы, боры, лемтэй".split(", "), level: 1),
    Subject(
        "Дӥськут",
        "Изьы, пӧзьы, дэрем, штань, чулка, улштань, улдэрем, кышет"
            .split(", "), level: 1),
    Subject("Удмурт дӥськут",
        "Дукес, айшет, чыртывесь, дэрем, кышет, кут".split(", "), level: 2),
    Subject(
        "Сапег",
        "Кирза, резин, ӝужыт, кунчиё, каблукен, каблуктэм, чорыган, шоголь"
            .split(", "), level: 3),
    Subject("Та мугор люкетъёсты шара вераны кепыраськом",
        "Ноны, пысы, сӥтян, кульы, пирог, пироггон, кунул".split(", "), level: 3),
    Subject("Валес", "Шобрет, миндэр, миндэр пуйы".split(", "), level: 1),
    Subject("'Нюлэс' мукет сямен", "Сик, тэль".split(", "), level: 0),
    Subject(
        "Писпуос", "Палэзьпу, льӧмпу, кызьпу, бадяр, кыз, пужым".split(", "), level: 1),
    // Subject(
    //     "...губи", "Сюрес, нин, тӧдьы, шыр, коньы (азьланьтыны)".split(", ")),
    // Subject("Юртъерын кулэ луэ",
    //     "Тӥр, молоток, кортӵог, пежъян, (азьланьтоно)".split(", ")),
    // Subject("Бакчаын ужан арбериос",
    //     "Лопатка, мажес (азьланьтоно, вань ке удмурт кылъёс)".split(", ")),
    Subject(
        "Дыр",
        "Туннэ, ӵуказе, валлян, тулыс, гужем, сӥзьыл, толалтэ, ӝыт, ӵукна, нуназе, уйин, нуназе бере, туэ"
            .split(", "), level: 3),
    Subject(
        "Тылобурдоос",
        "Сӥзь, кайсы, уйсы, бӧдёно, кикы, туливить, шушы, куака, ӟольгыри, кырныж, ӧрӟи, юсь, юбер, ӵана"
            .split(", "), level: 3),
    Subject(
        "Гурт тылобурдоос", "Ӵӧж, курег, чипы, ӟазег, атас, немыч".split(", "), level: 2),
    Subject(
        "Мунчоын",
        "Лапча, сурым, гур, веник, эгыр, кобы, майтал, ву, ӵын, пӧсь, эстӥськон"
            .split(", "), level: 2),
    Subject(
        "Нымы-кибыос",
        "Нӥзьыли, зоркибы, муш, кузьыли, чибинь, кут, дуринчи, бубыли, нумыр"
            .split(", "), level: 3),
    // Subject(
    //     "… ёрос",
    //     "Пичи Пурга, Кияса, Яр, Дебес (?), Вавож, Алнаш, Кизнер, Шаркан, Эгра (азьланьтоно)"
    //         .split(", ")),
    Subject(
        "Тусьты-пуньы",
        "Пуньы, тэркы, тусьты, дуры, сӥсъян, кастрюль, пияла"
            .split(", "), level: 1),
    // Subject(
    //     "Толалтэ",
    //     "Лымыпог, йӧ, лымы, гурезь, куас, кезьыт, Тол Бабай, Лымыныл"
    //         .split(", "), level: 1),
    Subject(
        "Гужем", "Пӧсь, шунды, шундыси, тымет, пыласькон, вужер".split(", "), level: 1),
    Subject(
        "Корка пушкын",
        "Вӧлдэт, выж, борддор, ӝӧк, пукон, ӟус, валес, чулан, ӧс, кышнопал"
            .split(", "), level: 1),
    Subject("Мугор пушкын",
        "Сӥтьсюл, сюлэм, лы, сӥль, вир, урдлыос, кӧй, мус".split(", "), level: 1),
  ]);
}
